OpenFOAM-v1812/tutorials/multiphase/interCondensatingEvaporatingFoam/condensatingVessel/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.01;

vertices
(
    (0 0 0)
    (0.2 0 0)
    (0.2 1 0)
    (0 1 0)
    (0 0 1)
    (0.2 0 1)
    (0.2 1 1)
    (0 1 1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (60 50 1) simpleGrading (3 1 1)
);


boundary
(
    bottom
    {
        type    wall;
        faces
        (
            (1 5 4 0)
        );
    }
    top
    {
        type    patch;
        faces
        (
            (3 7 6 2)
        );
    }
    left
    {
        type    wall;
        faces
        (
            (0 4 7 3)
        );
    }
    right
    {
        type    wall;
        faces
        (
            (2 6 5 1)
        );
    }
    frontAndBack
    {
        type    empty;
        faces
        (
            (4 5 6 7)
            (0 1 2 3)
        );
    }
);

// ************************************************************************* //
